org/Emacs/2014-12-26-How-to-Create-This-Homepage.org
#+HUGO_BASE_DIR: ../../hugo
#+HUGO_SECTION: Emacs
#+HUGO_TYPE: post
#+HUGO_LASTMOD: 2016-04-09
#+Title: How to create this homepage
#+DATE: <2014-12-26 Fri>
#+AUTHOR: Dominik Schrempf
#+EMAIL: dominik@schwarzbaer
#+DESCRIPTION:
#+KEYWORDS: Emacs, Org-Mode, Org Mode, Disqus, Homepage, Publish, Export
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.4.1 (Org mode 8.3beta)

This homepage was created with Emacs and [[http://orgmode.org/][Org mode]]. It is hosted at [[https://pages.github.com/][github.io]] and
comments can be done using [[https://disqus.com/][Disqus]]. I assume a working Org mode setup and a
GitHub as well as a Disqus account.

<2015-03-26 Thu> Update; general revision of code and text.

<2016-04-09 Sat> Another update.

* General idea
- Org mode :: A great tool for taking notes and exporting them to
     all kind of formats.  One of this formats is *HTML*.  The idea
     here is to use the publishing capabilities of Org mode to create
     a very basic website that can be used to blog and publish
     articles.
- GitHub :: Offers a freely available hosting service, a very easy way
     to make the website available.
- Disqus :: Provides the ability to comment posts.
Many people also use [[http://jekyllrb.com/][Jekyll]] to create homepages and blogs together
with Org mode and GitHub.  This is certainly a very appealing
alternative but I prefer a setting that is easier to set up and has
fewer options.

* Folder structure
I decided to use the following folder structure; it is somehow
arbitrary but the Org mode publishing setup has to be adjusted
accordingly:

#+begin_src sh :exports results :results verbatim
  tree -d -L 2 ~/Shared/blog
#+end_src

#+RESULTS:
#+begin_example
/home/dominik/Shared/blog
├── dschrempf.github.io
└── org
    ├── css
    ├── js
    └── posts

8 directories
#+end_example

The folders ~css~ and ~js~ are self explanatory.  Good style sheets
are hard to get.  I use a [[../../css/site.css][neat one]] from [[http://orgmode.org/worg/][Worg]] with a few changes.  For
this setup, it has to be saved as ~/blog/org/css/site.css~.
[[https://github.com/dschrempf/dschrempf.github.io][dschrempf.github.io]] is the git repository of the GitHub homepage
(there are detailed explanations on [[https://pages.github.com/][GitHub]] about how to set it up).
The posts created with Org mode reside in the ~org~ directory.  It is
important that you create an ~index.org~ file because GitHub is
looking for an ~index.html~ file and displays it as the main page.
You can use all capabilities of Org mode and its [[http://orgmode.org/manual/HTML-export.html#HTML-export][export and publishing
framework]].

