posts/Emacs/2014-12-26-How-to-Create-This-Homepage.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-04 Thu 16:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to create this homepage</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dominik Schrempf" />
<meta name="keywords" content="Emacs, Org-Mode, Org Mode, Disqus, Homepage, Publish, Export" />
<link rel='stylesheet' href='/css/site.css' type='text/css'/>
<meta name="viewport" content="width=device-width"/>
</head>
<body>
<div id="preamble" class="status">
<div class='nav'>
<ul>
<li><a href='/'>Home</a></li>
<li><a href='/archive.html'>Archive</a></li>
<li><a href='http://github.com/dschrempf'>GitHub</a></li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">How to create this homepage</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge694b74">General idea</a></li>
<li><a href="#org008dc6e">Folder structure</a></li>
<li><a href="#org6bbc472">Org Mode publishing setup</a></li>
<li><a href="#orgb14d12e">Workflow</a></li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2014-12-26 Fri&gt; </span></span> This homepage was created with Emacs and <a href="http://orgmode.org/">Org mode</a>.
It is hosted at <a href="https://pages.github.com/">github.io</a> and comments can be done using <a href="https://disqus.com/">Disqus</a>.  I
assume a working Org mode setup and a GitHub as well as a Disqus
account.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2015-03-26 Thu&gt; </span></span> Update; general revision of code and text.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-04-09 Sat&gt; </span></span> Another update.
</p>

<div id="outline-container-orge694b74" class="outline-2">
<h2 id="orge694b74">General idea</h2>
<div class="outline-text-2" id="text-orge694b74">
<dl class="org-dl">
<dt>Org mode</dt><dd>A great tool for taking notes and exporting them to
all kind of formats.  One of this formats is <b>HTML</b>.  The idea
here is to use the publishing capabilities of Org mode to create
a very basic website that can be used to blog and publish
articles.</dd>
<dt>GitHub</dt><dd>Offers a freely available hosting service, a very easy way
to make the website available.</dd>
<dt>Disqus</dt><dd>Provides the ability to comment posts.</dd>
</dl>
<p>
Many people also use <a href="http://jekyllrb.com/">Jekyll</a> to create homepages and blogs together
with Org mode and GitHub.  This is certainly a very appealing
alternative but I prefer a setting that is easier to set up and has
fewer options.
</p>
</div>
</div>

<div id="outline-container-org008dc6e" class="outline-2">
<h2 id="org008dc6e">Folder structure</h2>
<div class="outline-text-2" id="text-org008dc6e">
<p>
I decided to use the following folder structure; it is somehow
arbitrary but the Org mode publishing setup has to be adjusted
accordingly:
</p>

<div class="org-src-container">
<pre class="src src-sh">tree -d -L <span style="color: #a45bad;">2</span> ~/Shared/blog
</pre>
</div>

<pre class="example">
/home/dominik/Shared/blog
├── dschrempf.github.io
└── org
    ├── css
    ├── js
    └── posts

8 directories
</pre>

<p>
The folders <code>css</code> and <code>js</code> are self explanatory.  Good style sheets
are hard to get.  I use a <a href="../../css/site.css">neat one</a> from <a href="http://orgmode.org/worg/">Worg</a> with a few changes.  For
this setup, it has to be saved as <code>/blog/org/css/site.css</code>.
<a href="https://github.com/dschrempf/dschrempf.github.io">dschrempf.github.io</a> is the git repository of the GitHub homepage
(there are detailed explanations on <a href="https://pages.github.com/">GitHub</a> about how to set it up).
The posts created with Org mode reside in the <code>org</code> directory.  It is
important that you create an <code>index.org</code> file because GitHub is
looking for an <code>index.html</code> file and displays it as the main page.
You can use all capabilities of Org mode and its <a href="http://orgmode.org/manual/HTML-export.html#HTML-export">export and publishing
framework</a>.
</p>
</div>
</div>
