hugo/content/Emacs/2014-12-26-How-to-Create-This-Homepage.md
+++
title = "How to create this homepage"
author = ["Dominik Schrempf"]
date = 2014-12-26T00:00:00+01:00
keywords = ["Emacs", "", "", "Mode", "", "", "", ""]
lastmod = 2016-04-09
type = "post"
draft = false
+++

This homepage was created with Emacs and [Org mode](http://orgmode.org/). It is hosted at [github.io](https://pages.github.com/) and
comments can be done using [Disqus](https://disqus.com/). I assume a working Org mode setup and a
GitHub as well as a Disqus account.

<span class="timestamp-wrapper"><span class="timestamp">&lt;2015-03-26 Thu&gt; </span></span> Update; general revision of code and text.

<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-04-09 Sat&gt; </span></span> Another update.


## General idea {#general-idea}

Org mode
: A great tool for taking notes and exporting them to
    all kind of formats.  One of this formats is **HTML**.  The idea
    here is to use the publishing capabilities of Org mode to create
    a very basic website that can be used to blog and publish
    articles.

GitHub
: Offers a freely available hosting service, a very easy way
    to make the website available.

Disqus
: Provides the ability to comment posts.

Many people also use [Jekyll](http://jekyllrb.com/) to create homepages and blogs together
with Org mode and GitHub.  This is certainly a very appealing
alternative but I prefer a setting that is easier to set up and has
fewer options.


## Folder structure {#folder-structure}

I decided to use the following folder structure; it is somehow
arbitrary but the Org mode publishing setup has to be adjusted
accordingly:

```text
/home/dominik/Shared/blog
├── dschrempf.github.io
└── org
    ├── css
    ├── js
    └── posts

8 directories
```

The folders `css` and `js` are self explanatory.  Good style sheets
are hard to get.  I use a [neat one](../../css/site.css) from [Worg](http://orgmode.org/worg/) with a few changes.  For
this setup, it has to be saved as `/blog/org/css/site.css`.
[dschrempf.github.io](https://github.com/dschrempf/dschrempf.github.io) is the git repository of the GitHub homepage
(there are detailed explanations on [GitHub](https://pages.github.com/) about how to set it up).
The posts created with Org mode reside in the `org` directory.  It is
important that you create an `index.org` file because GitHub is
looking for an `index.html` file and displays it as the main page.
You can use all capabilities of Org mode and its [export and publishing
framework](http://orgmode.org/manual/HTML-export.html#HTML-export).
