posts/Emacs/2014-12-26-How-to-Create-This-Homepage.html

<div id="outline-container-org6bbc472" class="outline-2">
<h2 id="org6bbc472">Org Mode publishing setup</h2>
<div class="outline-text-2" id="text-org6bbc472">
<p>
This is the main step.  Org mode has to know how to export your Org
files so that they can be hosted by GitHub:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org7ae628c"><span style="color: #4f97d7;">(</span>setq org-publish-project-alist
      '<span style="color: #bc6ec5;">(</span>
        <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Blog posts in Org mode that are exported to html and hosted</span>
        <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">by GitHub.</span>
        <span style="color: #2d9574;">(</span><span style="color: #2d9574;">"blog"</span>
         <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Directory with Org files.</span>
         <span style="color: #4f97d7;">:base-directory</span> <span style="color: #2d9574;">"~/Shared/blog/org/"</span>
         <span style="color: #4f97d7;">:base-extension</span> <span style="color: #2d9574;">"org"</span>
         <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Output directory for html files on GitHub.</span>
         <span style="color: #4f97d7;">:publishing-directory</span> <span style="color: #2d9574;">"~/Shared/blog/dschrempf.github.io/"</span>
         <span style="color: #4f97d7;">:publishing-function</span> <span style="color: #67b11d;">(</span>org-html-publish-to-html<span style="color: #67b11d;">)</span>
         <span style="color: #4f97d7;">:html-extension</span> <span style="color: #2d9574;">"html"</span>
         <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Create a sitemap that contains all posts in</span>
         <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">anti-chronological order.</span>
         <span style="color: #4f97d7;">:auto-sitemap</span> t
         <span style="color: #4f97d7;">:sitemap-filename</span> <span style="color: #2d9574;">"archive.org"</span>
         <span style="color: #4f97d7;">:sitemap-title</span> <span style="color: #2d9574;">"Archive"</span>
         <span style="color: #4f97d7;">:sitemap-sort-files</span> anti-chronologically
         <span style="color: #4f97d7;">:sitemap-style</span> list
         <span style="color: #4f97d7;">:recursive</span> t
         <span style="color: #4f97d7;">:section-numbers</span> nil
         <span style="color: #4f97d7;">:with-toc</span> t
         <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Do not include predefined header scripts.</span>
         <span style="color: #4f97d7;">:html-head-include-default-style</span> nil
         <span style="color: #4f97d7;">:html-head-include-scripts</span> nil
         <span style="color: #4f97d7;">:html-head</span> <span style="color: #2d9574;">"&lt;link rel='stylesheet' href='/css/site.css' type='text/css'/&gt;</span>
<span style="color: #2d9574;">&lt;meta name=\"viewport\" content=\"width=device-width\"/&gt;"</span>
         <span style="color: #4f97d7;">:html-preamble</span> website-html-preamble
         <span style="color: #4f97d7;">:html-postamble</span> website-html-postamble
         <span style="color: #4f97d7;">:html-link-home</span> <span style="color: #2d9574;">"http://dschrempf.github.io/"</span>
         <span style="color: #4f97d7;">:html-link-use-abs-url</span> nil<span style="color: #2d9574;">)</span>

        <span style="color: #2d9574;">(</span><span style="color: #2d9574;">"static"</span>
         <span style="color: #4f97d7;">:base-directory</span> <span style="color: #2d9574;">"~/Shared/blog/org/"</span>
         <span style="color: #4f97d7;">:base-extension</span> <span style="color: #2d9574;">"css\\|js\\|jpg\\|gif\\|png\\|pdf\\|mp3\\|ogg\\|swf"</span>
         <span style="color: #4f97d7;">:publishing-directory</span> <span style="color: #2d9574;">"~/Shared/blog/dschrempf.github.io/"</span>
         <span style="color: #4f97d7;">:publishing-function</span> org-publish-attachment
         <span style="color: #4f97d7;">:recursive</span> t<span style="color: #2d9574;">)</span>

        <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">("website" :components ("blog" "images" "js" "css"))))</span>
        <span style="color: #2d9574;">(</span><span style="color: #2d9574;">"website"</span> <span style="color: #4f97d7;">:components</span> <span style="color: #67b11d;">(</span><span style="color: #2d9574;">"blog"</span> <span style="color: #2d9574;">"static"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
This defines a set of projects that can be published simultaneously
with the project <code>website</code> (e.g. with <code>M-x org-publish website</code>).  The
preamble includes a small header; the postamble includes the Disqus
comment section and Google Analytics (make sure to replace you
user name and tracking ID).
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org10458bd"><span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">BugFix: Manually disable home/up links in preamble.</span>
<span style="color: #4f97d7;">(</span>setq org-html-home/up-format <span style="color: #2d9574;">""</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">website-html-preamble</span> <span style="color: #bc6ec5;">(</span>info<span style="color: #bc6ec5;">)</span>
  <span style="color: #9f8766;">"Org-mode website HTML export preamble."</span>
  <span style="color: #bc6ec5;">(</span>format <span style="color: #2d9574;">"&lt;div class='nav'&gt;</span>
<span style="color: #2d9574;">&lt;ul&gt;</span>
<span style="color: #2d9574;">&lt;li&gt;&lt;a href='/'&gt;Home&lt;/a&gt;&lt;/li&gt;</span>
<span style="color: #2d9574;">&lt;li&gt;&lt;a href='/archive.html'&gt;Archive&lt;/a&gt;&lt;/li&gt;</span>
<span style="color: #2d9574;">&lt;/ul&gt;</span>
<span style="color: #2d9574;">&lt;/div&gt;"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">website-html-postamble</span> <span style="color: #bc6ec5;">(</span>info<span style="color: #bc6ec5;">)</span>
  <span style="color: #9f8766;">"Put Disqus into Org mode website postamble.  Do not show</span>
<span style="color: #9f8766;">   disqus for the Archive and the Index."</span>
  <span style="color: #bc6ec5;">(</span>concat
   <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">cond</span> <span style="color: #67b11d;">(</span><span style="color: #b1951d;">(</span>string= <span style="color: #4f97d7;">(</span>car <span style="color: #bc6ec5;">(</span>plist-get info <span style="color: #4f97d7;">:title</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2d9574;">"Archive"</span><span style="color: #b1951d;">)</span> <span style="color: #2d9574;">""</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span><span style="color: #b1951d;">(</span>string= <span style="color: #4f97d7;">(</span>car <span style="color: #bc6ec5;">(</span>plist-get info <span style="color: #4f97d7;">:title</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2d9574;">"Index"</span><span style="color: #b1951d;">)</span> <span style="color: #2d9574;">""</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span><span style="color: #b1951d;">(</span>string= <span style="color: #4f97d7;">(</span>car <span style="color: #bc6ec5;">(</span>plist-get info <span style="color: #4f97d7;">:title</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2d9574;">"GitHub -&gt; IO ()"</span><span style="color: #b1951d;">)</span> <span style="color: #2d9574;">""</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>t <span style="color: #2d9574;">"&lt;div id='disqus_thread'&gt;&lt;/div&gt;</span>
<span style="color: #2d9574;">&lt;script type='text/javascript'&gt;</span>
<span style="color: #2d9574;">  // required: replace example with your forum shortname</span>
<span style="color: #2d9574;">  var disqus_shortname = 'YOUR DISQUS NAME HERE';</span>
<span style="color: #2d9574;">  (function() {</span>
<span style="color: #2d9574;">      var dsq = document.createElement('script');</span>
<span style="color: #2d9574;">      dsq.type = 'text/javascript'; dsq.async = true;</span>
<span style="color: #2d9574;">      dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';</span>
<span style="color: #2d9574;">      (document.getElementsByTagName('head')[0] || </span>
<span style="color: #2d9574;">       document.getElementsByTagName('body')[0]).appendChild(dsq);</span>
<span style="color: #2d9574;">  })();</span>
<span style="color: #2d9574;">&lt;/script&gt;</span>
<span style="color: #2d9574;">&lt;noscript&gt;&lt;p&gt;Please enable JavaScript to view the</span>
<span style="color: #2d9574;">  &lt;a href='http://disqus.com/?ref_noscript'&gt;comments powered by Disqus.&lt;/a&gt;&lt;/p&gt;</span>
<span style="color: #2d9574;">&lt;/noscript&gt;"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>format <span style="color: #2d9574;">"&lt;div class='footer'&gt;</span>
<span style="color: #2d9574;">Copyright 2014 AUTHOR&lt;br/&gt;</span>
<span style="color: #2d9574;">Last updated %s &lt;br/&gt;</span>
<span style="color: #2d9574;">Built with %s &lt;br/&gt;</span>
<span style="color: #2d9574;">%s HTML</span>
<span style="color: #2d9574;">&lt;/div&gt;</span>
<span style="color: #2d9574;">&lt;script type='text/javascript'&gt;</span>
<span style="color: #2d9574;"> (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){</span>
<span style="color: #2d9574;"> (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),</span>
<span style="color: #2d9574;"> m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)</span>
<span style="color: #2d9574;"> })(window,document,'script','//www.google-analytics.com/analytics.js','ga');</span>

<span style="color: #2d9574;"> ga('create', 'PUT YOUR TRACKING ID HERE', 'auto');</span>
<span style="color: #2d9574;"> ga('send', 'pageview');</span>

<span style="color: #2d9574;">&lt;/script&gt;"</span>
           <span style="color: #67b11d;">(</span>format-time-string <span style="color: #2d9574;">"%Y-%m-%d"</span><span style="color: #67b11d;">)</span>
           org-html-creator-string
           org-html-validation-link<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
