org/Emacs/2014-12-26-How-to-Create-This-Homepage.org
* Workflow
Create your homepages with Emacs Org mode.  The ~index.org~ file can
include links to all blog articles.  Links, source blocks, images and
so on can be used everywhere.  This is explained in great detail on
the [[http://orgmode.org/manual/HTML-export.html#HTML-export][Org mode homepage]].  Publish the homepage with =org-publish= (i.e.,
bind this to a key) and push the changes to GitHub.  Voila!
