hugo/content/Emacs/2014-12-26-How-to-Create-This-Homepage.md


## Workflow {#workflow}

Create your homepages with Emacs Org mode.  The `index.org` file can
include links to all blog articles.  Links, source blocks, images and
so on can be used everywhere.  This is explained in great detail on
the [Org mode homepage](http://orgmode.org/manual/HTML-export.html#HTML-export).  Publish the homepage with `org-publish` (i.e.,
bind this to a key) and push the changes to GitHub.  Voila!
